# Homework

## Problem 4

### Import the libraries

#### Import արեք pandas գրադարանը pd  անունով

In [7]:
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [87]:
baby_names = pd.read_csv('baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [88]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [89]:
baby_names = baby_names.drop(columns=['Unnamed: 0', 'Id'], axis=1)

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [90]:
male_female = baby_names.groupby("Gender").agg({"Name":"count"})
print(male_female)

        Name
Gender
F       2404
M         99

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [91]:
baby_names = baby_names.drop(columns=['Year'])

names = baby_names.groupby("Name")

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [92]:
baby_names["Name"].nunique()

575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [121]:
max_name = baby_names.groupby("Name").agg({"Count":'max'})
max_name[max_name["Count"] == max_name["Count"].max()]

       Count
Name
Ethan     65

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [133]:
median_name = baby_names.groupby("Name").agg({"Count":'max'})
median_name[median_name["Count"] == median_name["Count"].median()]

            Count
Name
Alicia          9
Amanda          9
Amara           9
Angela          9
Ariel           9
Ashlynn         9
Ayla            9
Brielle         9
Charlie         9
Delaney         9
Desiree         9
Eliana          9
Elsa            9
Evangeline      9
Everly          9
Kiara           9
Kyla            9
Kyra            9
Leila           9
Lindsey         9
Madeline        9
Margaret        9
Mckinley        9
Miley           9
Natalia         9
Sabrina         9
Teagan          9
Tessa           9
Vivian          9

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [94]:
baby_names.describe()

             Count
count  2503.000000
mean     11.485018
std       8.830294
min       5.000000
25%       6.000000
50%       8.000000
75%      13.000000
max      65.000000